doc/src/developer.org
#+Title: EMF Views Developer Guide

* How EMF Views works
We create virtual elements that stand-off for each element in the contributing
models.

# A picture of data coming in and out of the different EMF Views classes
# (pipeline) would be very handy, as an overview

# TODO: We require sexp2emf, don't we?

* Hacking on EMF Views
** Overview
EMF Views is first and foremost an Eclipse plugin (or rather, a suite of Eclipse
plugins).  Its purpose is to let users to build views from EMF-based models.
The core plugin provides the logic for creating these views, and the other
plugins provide extra conveniences: DSLs for creating views easily, an
experimental viewer, extension facilities, etc.

Most of the critical code thus resides in the core plugin
(~org.atlanmod.emfviews~), and in the Ecore-generated virtual links model.
However, we also have an extensive manual and examples.

*** Repository hierarchy
If we take a look into the EMF Views repository, here is what we will see:

#+BEGIN_EXAMPLE
.
├── doc
│   ├── org.atlanmod.emfviews.doc
│   └── src
├── dsls
│   ├── mel
│   └── vpdl
├── examples
│   ├── emfviews-tutorial
│   ├── programmatic-view-tutorial
│   ├── traceability-demo
│   ├── view-to-html-tutorial
│   └── vpdl-tutorial
├── features
│   ├── org.atlanmod.emfviews.feature
│   ├── org.atlanmod.emfviews.mel.feature
│   └── org.atlanmod.emfviews.vpdl.feature
├── plugins
│   ├── org.atlanmod.emfviews
│   ├── org.atlanmod.emfviews.ui.editors
│   ├── org.atlanmod.emfviews.virtuallinks
│   └── org.atlanmod.emfviews.virtuallinksepsilondelegate
├── tests
│   └── org.atlanmod.emfviews.tests
└── update
#+END_EXAMPLE

In order, we have:

- The *doc* folder which contains the Org source for the EMF Views manual and
  the Eclipse help plugin.  See the section [[*Building the manual][The manual]].

- The *dsls* folder contains the Xtext-based projects for our two languages that
  help build views, as well as their tests.  See [[*VPDL and MEL][VPDL and MEL]].

- The *examples* folder contains the source code and models for the tutorials
  and demos.  The tutorials are documented in [[file:user.org::*Tutorials][the user manual]].

- The *features* folder contains the Eclipse features for the update site.
  There is one feature for the core plugin, and one per DSL.  An Eclipse feature
  is just a group of plugins, to simplify installation and dependency
  management.

- The *plugins* folder contains the core plugins, namely ~org.atlanmod.emfviews~
  and the virtual links model which is generated from Ecore.  The ECL delegate
  plugin (see [[file:user.org::*Adding%20new%20matching%20models][Adding new matching models]]) is used to create views from an ECL
  file.  There is also an experimental views browser in
  ~org.atlanmod.emfviews.ui.editors~.

- The *tests* folder contains the tests for the core plugins.  These tests are
  run by our [[*Maven build overview][Maven build]] and on our [[*Continuous integration][continuous integration]].

- Finally, the *update* folder contains the update site configuration.  An
  Eclipse update site is just a bunch of JARs and XML description files.  This
  is a convenient way for users to install multiple plugins from the same
  vendor.  Our update site simply regroups all the features.

** Building and running the project manually
See the [[https://github.com/atlanmod/emfviews#development-setup][Development setup]] instructions in the README.

While you can use Maven to build and run the tests, most of the interesting
functionality of the plugins comes from actually using it in an Eclipse
application, in concert with other EMF-based tools like the Sample Ecore Editor,
the [[eclipse:/topic/org.eclipse.modisco.infrastructure.doc/mediawiki/model_browser/user.html][MoDisco Model Browser]] or [[eclipse:/topic/org.eclipse.m2m.atl.doc/guide/concepts/ATL%2520Concepts.html][ATL]].

We thus recommend that you import the projects in Eclipse.  You can then run
another Eclipse instance with the plugins loaded; if you use a debug instance
(Debug As \to Eclise Application) instead, you will be able to tweak the code
while the client instance is running, which can make for a more pleasing
development experience.

