manual/developer.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<title>EMF Views Developer Guide</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel="stylesheet" href="style.css">
</head>
<body>
<h1 class="title">EMF Views Developer Guide</h1>
<div id="content">
<div id="table-of-contents">
<h2>EMF Views Developer Guide</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#how-emf-views-works">How EMF Views works</a></li>
<li><a href="#hacking-on-emf-views">Hacking on EMF Views</a>
<ul>
<li><a href="#overview">Overview</a>
<ul>
<li><a href="#repository-hierarchy">Repository hierarchy</a></li>
</ul>
</li>
<li><a href="#building-and-running-the-project-manually">Building and running the project manually</a>
<ul>
<li><a href="#maven-build-overview">Maven build overview</a></li>
</ul>
</li>
<li><a href="#vpdl-and-mel">VPDL and MEL</a>
<ul>
<li><a href="#maven-build-of-xtext-dsls">Maven build of Xtext DSLs</a></li>
</ul>
</li>
<li><a href="#building-the-manual">Building the manual</a></li>
<li><a href="#continuous-integration">Continuous integration</a></li>
</ul>
</li>
</ul>
</div>
</div>


<h2 id="how-emf-views-works"><a href="#how-emf-views-works">How EMF Views works</a></h2>
<p>
We create virtual elements that stand-off for each element in the contributing
models.
</p>


<h2 id="hacking-on-emf-views"><a href="#hacking-on-emf-views">Hacking on EMF Views</a></h2>

<h3 id="overview"><a href="#overview">Overview</a></h3>
<p>
EMF Views is first and foremost an Eclipse plugin (or rather, a suite of Eclipse
plugins).  Its purpose is to let users to build views from EMF-based models.
The core plugin provides the logic for creating these views, and the other
plugins provide extra conveniences: DSLs for creating views easily, an
experimental viewer, extension facilities, etc.
</p>

<p>
Most of the critical code thus resides in the core plugin
(<code>org.atlanmod.emfviews</code>), and in the Ecore-generated virtual links model.
However, we also have an extensive manual and examples.
</p>


<h4 id="repository-hierarchy"><a href="#repository-hierarchy">Repository hierarchy</a></h4>
<p>
If we take a look into the EMF Views repository, here is what we will see:
</p>

<pre class="example">
.
├── doc
│   ├── org.atlanmod.emfviews.doc
│   └── src
├── dsls
│   ├── mel
│   └── vpdl
├── examples
│   ├── emfviews-tutorial
│   ├── programmatic-view-tutorial
│   ├── traceability-demo
│   ├── view-to-html-tutorial
│   └── vpdl-tutorial
├── features
│   ├── org.atlanmod.emfviews.feature
│   ├── org.atlanmod.emfviews.mel.feature
│   └── org.atlanmod.emfviews.vpdl.feature
├── plugins
│   ├── org.atlanmod.emfviews
│   ├── org.atlanmod.emfviews.ui.editors
│   ├── org.atlanmod.emfviews.virtuallinks
│   └── org.atlanmod.emfviews.virtuallinksepsilondelegate
├── tests
│   └── org.atlanmod.emfviews.tests
└── update
</pre>

<p>
In order, we have:
</p>

<ul class="org-ul">
<li>The <b>doc</b> folder which contains the Org source for the EMF Views manual and
the Eclipse help plugin.  See the section <a href="#building-the-manual">The manual</a>.</li>

<li>The <b>dsls</b> folder contains the Xtext-based projects for our two languages that
help build views, as well as their tests.  See <a href="#vpdl-and-mel">VPDL and MEL</a>.</li>

<li>The <b>examples</b> folder contains the source code and models for the tutorials
and demos.  The tutorials are documented in <a href="user.html#tutorials">the user manual</a>.</li>

<li>The <b>features</b> folder contains the Eclipse features for the update site.
There is one feature for the core plugin, and one per DSL.  An Eclipse feature
is just a group of plugins, to simplify installation and dependency
management.</li>

<li>The <b>plugins</b> folder contains the core plugins, namely <code>org.atlanmod.emfviews</code>
and the virtual links model which is generated from Ecore.  The ECL delegate
plugin (see <a href="user.html#adding-new-matching-models">Adding new matching models</a>) is used to create views from an ECL
file.  There is also an experimental views browser in
<code>org.atlanmod.emfviews.ui.editors</code>.</li>

<li>The <b>tests</b> folder contains the tests for the core plugins.  These tests are
run by our <a href="#maven-build-overview">Maven build</a> and on our <a href="#continuous-integration">continuous integration</a>.</li>

<li>Finally, the <b>update</b> folder contains the update site configuration.  An
Eclipse update site is just a bunch of JARs and XML description files.  This
is a convenient way for users to install multiple plugins from the same
vendor.  Our update site simply regroups all the features.</li>
</ul>


<h3 id="building-and-running-the-project-manually"><a href="#building-and-running-the-project-manually">Building and running the project manually</a></h3>
<p>
See the <a href="https://github.com/atlanmod/emfviews#development-setup">Development setup</a> instructions in the README.
</p>

<p>
While you can use Maven to build and run the tests, most of the interesting
functionality of the plugins comes from actually using it in an Eclipse
application, in concert with other EMF-based tools like the Sample Ecore Editor,
the <a href="https://help.eclipse.org/oxygen/topic/org.eclipse.modisco.infrastructure.doc/mediawiki/model_browser/user.html">MoDisco Model Browser</a> or <a href="https://help.eclipse.org/oxygen/topic/org.eclipse.m2m.atl.doc/guide/concepts/ATL%20Concepts.html">ATL</a>.
</p>

<p>
We thus recommend that you import the projects in Eclipse.  You can then run
another Eclipse instance with the plugins loaded; if you use a debug instance
(Debug As &rarr; Eclise Application) instead, you will be able to tweak the code
while the client instance is running, which can make for a more pleasing
development experience.
</p>
