doc/src/developer.org
*** Maven build overview
The Maven build is there mostly for our [[*Continuous integration][continuous integration]], since it's
about the only sane way to build Eclipse plugins in batch.

The way it is setup, we have a ~pom.xml~ file at the root which declares a bunch
of modules:

#+BEGIN_SRC xml
<modules>
  <module>plugins</module>
  <module>features</module>
  <module>update</module>
  <module>tests</module>
  <module>dsls</module>
  <module>doc</module>
</modules>
#+END_SRC

In each module, you will find another ~pom.xml~ file with its own modules, etc.
The leaves of this tree are the actual plugins, which use the ~eclipse-plugin~
packaging:

#+BEGIN_SRC xml
<packaging>eclipse-plugin</packaging>
#+END_SRC

Invoking ~mvn install~ (or any other target) in the root directory will make use
of all the ~pom.xml~ files.

The plugins are built using [[https://www.eclipse.org/tycho/][Tycho]], a Maven extension for building Eclipse
plugins.  The benefit of Tycho is that it is pulling the plugin dependencies
from the ~plugin.xml~ files, so we don't have to duplicate our list of
dependencies.  Most of the Tycho configuration is in the root ~pom.xml~ and
shouldn't need much tweaking.

The most likely source of adjustment is in bumping the top-level dependencies.
You can easily find them at the top of the root ~pom.xml~:

#+BEGIN_SRC xml
<properties>
  <tycho-version>1.1.0</tycho-version>
  <eclipse-oxygen>
    http://download.eclipse.org/releases/oxygen/201712201001
  </eclipse-oxygen>
  <eclipse-epsilon>
    http://download.eclipse.org/epsilon/updates/
  </eclipse-epsilon>
  <xtext-version>2.14.0</xtext-version>
</properties>
#+END_SRC

Should you require a more recent version of Eclipse, or Xtext, this is where to
change it.

The Maven builds runs with JUnit, as running them in Eclipse would do.  Note
that running all the tests require additional dependencies, as stated by the
~pom.xml~ of ~org.atlanmod.emfviews.tests~:

#+BEGIN_SRC xml
<repositories>
  <repository>
    <id>obeo-bpmn2</id>
    <layout>p2</layout>
    <url>
https://s3-eu-west-1.amazonaws.com/obeo-bpmndesigner-releases/3.5.0/repository/
    </url>
  </repository>

  <repository>
    <id>eclipse-reqif</id>
    <layout>p2</layout>
    <url>http://download.eclipse.org/rmf/updates/releases/0.13.0/</url>
  </repository>
</repositories>
#+END_SRC

Building the DSLs using Maven required more pipework, which [[*Maven build of Xtext DSLs][see]].

