manual/developer.html


<h4 id="maven-build-overview"><a href="#maven-build-overview">Maven build overview</a></h4>
<p>
The Maven build is there mostly for our <a href="#continuous-integration">continuous integration</a>, since it's
about the only sane way to build Eclipse plugins in batch.
</p>

<p>
The way it is setup, we have a <code>pom.xml</code> file at the root which declares a bunch
of modules:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">modules</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">plugins</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">features</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">update</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">tests</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">dsls</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">doc</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">module</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">modules</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
In each module, you will find another <code>pom.xml</code> file with its own modules, etc.
The leaves of this tree are the actual plugins, which use the <code>eclipse-plugin</code>
packaging:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">packaging</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">eclipse-plugin</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">packaging</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
Invoking <code>mvn install</code> (or any other target) in the root directory will make use
of all the <code>pom.xml</code> files.
</p>

<p>
The plugins are built using <a href="https://www.eclipse.org/tycho/">Tycho</a>, a Maven extension for building Eclipse
plugins.  The benefit of Tycho is that it is pulling the plugin dependencies
from the <code>plugin.xml</code> files, so we don't have to duplicate our list of
dependencies.  Most of the Tycho configuration is in the root <code>pom.xml</code> and
shouldn't need much tweaking.
</p>

<p>
The most likely source of adjustment is in bumping the top-level dependencies.
You can easily find them at the top of the root <code>pom.xml</code>:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">properties</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">tycho-version</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">1.1.0</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">tycho-version</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">eclipse-oxygen</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">    http://download.eclipse.org/releases/oxygen/201712201001</span>
<span class="org-nxml-text">  </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">eclipse-oxygen</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">eclipse-epsilon</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">    http://download.eclipse.org/epsilon/updates/</span>
<span class="org-nxml-text">  </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">eclipse-epsilon</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">xtext-version</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">2.14.0</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">xtext-version</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">properties</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
Should you require a more recent version of Eclipse, or Xtext, this is where to
change it.
</p>

<p>
The Maven builds runs with JUnit, as running them in Eclipse would do.  Note
that running all the tests require additional dependencies, as stated by the
<code>pom.xml</code> of <code>org.atlanmod.emfviews.tests</code>:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">repositories</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">repository</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">id</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">obeo-bpmn2</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">id</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">layout</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">p2</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">layout</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">url</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">https://s3-eu-west-1.amazonaws.com/obeo-bpmndesigner-releases/3.5.0/repository/</span>
<span class="org-nxml-text">    </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">url</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">repository</span><span class="org-nxml-tag-delimiter">&gt;</span>

  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">repository</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">id</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">eclipse-reqif</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">id</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">layout</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">p2</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">layout</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">url</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">http://download.eclipse.org/rmf/updates/releases/0.13.0/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">url</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">repository</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">repositories</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
Building the DSLs using Maven required more pipework, which <a href="#maven-build-of-xtext-dsls">see</a>.
</p>
