doc/src/developer.org
** VPDL and MEL
VPDL and MEL are two domain-specific languages (DSLs) that are used to simplify
the creation of views, or more precisely, the creation of a view weaving model
(virtual links).  For more on how to use these DSLs, see the [[file:user.org::*VPDL][user manual]].

We have developed these DSLs with [[https://www.eclipse.org/Xtext/][Xtext]], which conveniently generates a parser
and an editor plugin with auto-completion and error reporting directly from a
source grammar.  Here are the [[https://github.com/atlanmod/emfviews/blob/master/dsls/vpdl/org.atlanmod.emfviews.vpdl/src/org/atlanmod/emfviews/vpdl/Vpdl.xtext][VPDL]] and [[https://github.com/atlanmod/emfviews/blob/master/dsls/mel/org.atlanmod.emfviews.mel/src/org/atlanmod/emfviews/mel/Mel.xtext][MEL]] grammars.

Xtext grammars are essentially BNF-based, but instead of giving you parse trees,
they give you graphs as EMF models.

We then turn a parsed graph into a virtual links model using an ATL
transformation.  This is done by the extending the ~AbstractGenerator~ class.
We also create ~eview~ and ~eviewpoint~ files, accordingly.  See [[https://github.com/atlanmod/emfviews/blob/master/dsls/vpdl/org.atlanmod.emfviews.vpdl/src/org/atlanmod/emfviews/vpdl/generator/VpdlGenerator.xtend][VpdlGenerator]]
and [[https://github.com/atlanmod/emfviews/blob/master/dsls/mel/org.atlanmod.emfviews.mel/src/org/atlanmod/emfviews/mel/generator/MelGenerator.xtend][MelGenerator]] for how this is done.  Note that these are ~.xtend~ files:
this is a Java-like language, but more dynamic, and well-suited for creating
templates.  These get compiled to Java files, and the use of Xtend is
transparent to the end-user.

We also enhance the validation and auto-completion of these DSLs by extending
the ~AbstractScopeProvider~ of Xtext.  In VPDL for instance, we want to make
sure only valid classes or attributes are used, with respect to the declared
metamodels.  This is done in [[https://github.com/atlanmod/emfviews/blob/master/dsls/vpdl/org.atlanmod.emfviews.vpdl/src/org/atlanmod/emfviews/vpdl/scoping/VpdlScopeProvider.xtend][VpdlScopeProvider]]; see [[https://github.com/atlanmod/emfviews/blob/master/dsls/mel/org.atlanmod.emfviews.mel/src/org/atlanmod/emfviews/mel/scoping/MelScopeProvider.xtend][MelScopeProvider]] for MEL.

*** Maven build of Xtext DSLs
Build the DSLs using Maven is more involved than simply using Tycho.  We need
to:

1. Add a goal to regenerate the plugins from the Xtext grammar.
2. Compile the Xtend files to Java.
3. Compile the ATL transformations to EMFTVM bytecode.
4. Cleanup these files for the ~clean~ goal.

The first two tasks are documented, and we can use the ~xtend-maven-plugin~ for
the first one, and the ~exec-maven-plugin~ for the second.  Generating the
plugins from the grammar can take a while though, and usually you don't want to
do it unless the grammar has been changed.  You can skip this step by passing
~-Dmwe2-skip-generate=true~ to ~mvn~.

Running ATL EMFTVM in Maven is possible only since ATL 4.0, but it works well.

Cleaning up generated files is verbose, but straightforward.  See the [[https://github.com/atlanmod/emfviews/blob/master/dsls/pom.xml][pom.xml]]
for details.

** Building the manual
The EMF Views manual is what you are reading right now.  There are two versions
of it: the online HTML version published [[https://www.atlanmod.org/emfviews/manual/][here]], and the Eclipes Help version,
published as an Eclipse help plugin (~org.atlanmod.emfviews.doc~) and available
from the Help \to Contents menu inside Eclipse if you have the plugin installed.
Both versions are identical in content, but the Eclipse plugin is easy to access
offline.

See [[https://github.com/atlanmod/emfviews#building-the-manual][Building the manual]] in the README for basic build instructions.

The manual is written in [[https://orgmode.org/][Org]].  The syntax is akin to Markdown, but Org provides
a very convenient and customizable export to HTML.  In this respect, it is
closer to [[http://www.sphinx-doc.org/][Sphinx]], but the Org syntax is more sensible, and we can customize the
whole pipeline in Emacs Lisp instead of Python.

The manual is built simply by invoking ~make~, which in turn invokes ~emacs~ to
build both versions.  All the setup for the HTML export is done in the single
~doc/publish.el~ file, which is well commented.

Note that as the ~org.atlanmod.emfviews.doc~ plugin is part of the update site,
if you want to build the update site manually with ~mvn install~, you should
first build the manual.  You shouldn't need to build the update site manually
though, as it is built automatically by our [[*Continuous integration][continuous integration]].

** Continuous integration
We use [[https://travis-ci.org/][Travis]] to run our tests after each commit.  This is done using the [[*Maven build overview][Maven
build]].  See the [[https://github.com/atlanmod/emfviews/blob/master/.travis.yml][Travis configuration file]] for details.

After each successful build on the ~master~ branch, we also build the manual and
deploy it on the [[https://www.atlanmod.org/emfviews/][EMF Views website]], on the ~gh-pages~ branch.  The way we do
this is more involved than what is suggested by the Travis documentation, with
good reasons documented in [[https://github.com/atlanmod/emfviews/blob/master/.travis/deploy.sh][the deploy script]].

Technically building the online manual could be a separate Travis job, but since
we need the manual to build the ~org.atlanmod.emfviews.doc~ plugin, it's better
to build it only once.

#+BEGIN_note
On success, we should deploy snapshots of the update site to
updates.atlanmod.org.  This is not currently the case due to issues with finding
a hosting server.
#+END_note
