manual/developer.html


<h3 id="vpdl-and-mel"><a href="#vpdl-and-mel">VPDL and MEL</a></h3>
<p>
VPDL and MEL are two domain-specific languages (DSLs) that are used to simplify
the creation of views, or more precisely, the creation of a view weaving model
(virtual links).  For more on how to use these DSLs, see the <a href="user.html#vpdl">user manual</a>.
</p>

<p>
We have developed these DSLs with <a href="https://www.eclipse.org/Xtext/">Xtext</a>, which conveniently generates a parser
and an editor plugin with auto-completion and error reporting directly from a
source grammar.  Here are the <a href="https://github.com/atlanmod/emfviews/blob/master/dsls/vpdl/org.atlanmod.emfviews.vpdl/src/org/atlanmod/emfviews/vpdl/Vpdl.xtext">VPDL</a> and <a href="https://github.com/atlanmod/emfviews/blob/master/dsls/mel/org.atlanmod.emfviews.mel/src/org/atlanmod/emfviews/mel/Mel.xtext">MEL</a> grammars.
</p>

<p>
Xtext grammars are essentially BNF-based, but instead of giving you parse trees,
they give you graphs as EMF models.
</p>

<p>
We then turn a parsed graph into a virtual links model using an ATL
transformation.  This is done by the extending the <code>AbstractGenerator</code> class.
We also create <code>eview</code> and <code>eviewpoint</code> files, accordingly.  See <a href="https://github.com/atlanmod/emfviews/blob/master/dsls/vpdl/org.atlanmod.emfviews.vpdl/src/org/atlanmod/emfviews/vpdl/generator/VpdlGenerator.xtend">VpdlGenerator</a>
and <a href="https://github.com/atlanmod/emfviews/blob/master/dsls/mel/org.atlanmod.emfviews.mel/src/org/atlanmod/emfviews/mel/generator/MelGenerator.xtend">MelGenerator</a> for how this is done.  Note that these are <code>.xtend</code> files:
this is a Java-like language, but more dynamic, and well-suited for creating
templates.  These get compiled to Java files, and the use of Xtend is
transparent to the end-user.
</p>

<p>
We also enhance the validation and auto-completion of these DSLs by extending
the <code>AbstractScopeProvider</code> of Xtext.  In VPDL for instance, we want to make
sure only valid classes or attributes are used, with respect to the declared
metamodels.  This is done in <a href="https://github.com/atlanmod/emfviews/blob/master/dsls/vpdl/org.atlanmod.emfviews.vpdl/src/org/atlanmod/emfviews/vpdl/scoping/VpdlScopeProvider.xtend">VpdlScopeProvider</a>; see <a href="https://github.com/atlanmod/emfviews/blob/master/dsls/mel/org.atlanmod.emfviews.mel/src/org/atlanmod/emfviews/mel/scoping/MelScopeProvider.xtend">MelScopeProvider</a> for MEL.
</p>


<h4 id="maven-build-of-xtext-dsls"><a href="#maven-build-of-xtext-dsls">Maven build of Xtext DSLs</a></h4>
<p>
Build the DSLs using Maven is more involved than simply using Tycho.  We need
to:
</p>

<ol class="org-ol">
<li>Add a goal to regenerate the plugins from the Xtext grammar.</li>
<li>Compile the Xtend files to Java.</li>
<li>Compile the ATL transformations to EMFTVM bytecode.</li>
<li>Cleanup these files for the <code>clean</code> goal.</li>
</ol>

<p>
The first two tasks are documented, and we can use the <code>xtend-maven-plugin</code> for
the first one, and the <code>exec-maven-plugin</code> for the second.  Generating the
plugins from the grammar can take a while though, and usually you don't want to
do it unless the grammar has been changed.  You can skip this step by passing
<code>-Dmwe2-skip-generate=true</code> to <code>mvn</code>.
</p>

<p>
Running ATL EMFTVM in Maven is possible only since ATL 4.0, but it works well.
</p>

<p>
Cleaning up generated files is verbose, but straightforward.  See the <a href="https://github.com/atlanmod/emfviews/blob/master/dsls/pom.xml">pom.xml</a>
for details.
</p>


<h3 id="building-the-manual"><a href="#building-the-manual">Building the manual</a></h3>
<p>
The EMF Views manual is what you are reading right now.  There are two versions
of it: the online HTML version published <a href="https://www.atlanmod.org/emfviews/manual/">here</a>, and the Eclipes Help version,
published as an Eclipse help plugin (<code>org.atlanmod.emfviews.doc</code>) and available
from the Help &rarr; Contents menu inside Eclipse if you have the plugin installed.
Both versions are identical in content, but the Eclipse plugin is easy to access
offline.
</p>

<p>
See <a href="https://github.com/atlanmod/emfviews#building-the-manual">Building the manual</a> in the README for basic build instructions.
</p>

<p>
The manual is written in <a href="https://orgmode.org/">Org</a>.  The syntax is akin to Markdown, but Org provides
a very convenient and customizable export to HTML.  In this respect, it is
closer to <a href="http://www.sphinx-doc.org/">Sphinx</a>, but the Org syntax is more sensible, and we can customize the
whole pipeline in Emacs Lisp instead of Python.
</p>

<p>
The manual is built simply by invoking <code>make</code>, which in turn invokes <code>emacs</code> to
build both versions.  All the setup for the HTML export is done in the single
<code>doc/publish.el</code> file, which is well commented.
</p>

<p>
Note that as the <code>org.atlanmod.emfviews.doc</code> plugin is part of the update site,
if you want to build the update site manually with <code>mvn install</code>, you should
first build the manual.  You shouldn't need to build the update site manually
though, as it is built automatically by our <a href="#continuous-integration">continuous integration</a>.
</p>


<h3 id="continuous-integration"><a href="#continuous-integration">Continuous integration</a></h3>
<p>
We use <a href="https://travis-ci.org/">Travis</a> to run our tests after each commit.  This is done using the <a href="#maven-build-overview">Maven
build</a>.  See the <a href="https://github.com/atlanmod/emfviews/blob/master/.travis.yml">Travis configuration file</a> for details.
</p>

<p>
After each successful build on the <code>master</code> branch, we also build the manual and
deploy it on the <a href="https://www.atlanmod.org/emfviews/">EMF Views website</a>, on the <code>gh-pages</code> branch.  The way we do
this is more involved than what is suggested by the Travis documentation, with
good reasons documented in <a href="https://github.com/atlanmod/emfviews/blob/master/.travis/deploy.sh">the deploy script</a>.
</p>

<p>
Technically building the online manual could be a separate Travis job, but since
we need the manual to build the <code>org.atlanmod.emfviews.doc</code> plugin, it's better
to build it only once.
</p>

<div class="note">
<p>
On success, we should deploy snapshots of the update site to
updates.atlanmod.org.  This is not currently the case due to issues with finding
a hosting server.
</p>

</div>
</div>
</body>
</html>
